zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_lptim.h
/** @defgroup LPTIM_LL_EC_CLK_SOURCE Clock Source
  * @{
  */
#define LL_LPTIM_CLK_SOURCE_INTERNAL          0x00000000U      /*!<LPTIM is clocked by internal clock source (APB clock or any of the embedded oscillators)*/
#define LL_LPTIM_CLK_SOURCE_EXTERNAL          LPTIM_CFGR_CKSEL /*!<LPTIM is clocked by an external clock source through the LPTIM external Input1*/
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_CLK_FILTER Clock Filter
  * @{
  */
#define LL_LPTIM_CLK_FILTER_NONE              0x00000000U        /*!<Any external clock signal level change is considered as a valid transition*/
#define LL_LPTIM_CLK_FILTER_2                 LPTIM_CFGR_CKFLT_0 /*!<External clock signal level change must be stable for at least 2 clock periods before it is considered as valid transition*/
#define LL_LPTIM_CLK_FILTER_4                 LPTIM_CFGR_CKFLT_1 /*!<External clock signal level change must be stable for at least 4 clock periods before it is considered as valid transition*/
#define LL_LPTIM_CLK_FILTER_8                 LPTIM_CFGR_CKFLT   /*!<External clock signal level change must be stable for at least 8 clock periods before it is considered as valid transition*/
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_CLK_POLARITY Clock Polarity
  * @{
  */
#define LL_LPTIM_CLK_POLARITY_RISING          0x00000000U        /*!< The rising edge is the active edge used for counting*/
#define LL_LPTIM_CLK_POLARITY_FALLING         LPTIM_CFGR_CKPOL_0 /*!< The falling edge is the active edge used for counting*/
#define LL_LPTIM_CLK_POLARITY_RISING_FALLING  LPTIM_CFGR_CKPOL_1 /*!< Both edges are active edges*/
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_ENCODER_MODE Encoder Mode
  * @{
  */
#define LL_LPTIM_ENCODER_MODE_RISING          0x00000000U        /*!< The rising edge is the active edge used for counting*/
#define LL_LPTIM_ENCODER_MODE_FALLING         LPTIM_CFGR_CKPOL_0 /*!< The falling edge is the active edge used for counting*/
#define LL_LPTIM_ENCODER_MODE_RISING_FALLING  LPTIM_CFGR_CKPOL_1 /*!< Both edges are active edges*/
/**
  * @}
  */

/** @defgroup LPTIM_EC_INPUT1_SRC Input1 Source
  * @{
  */
#define LL_LPTIM_INPUT1_SRC_GPIO         0x00000000UL                                           /*!< For LPTIM1 and LPTIM2 */
#define LL_LPTIM_INPUT1_SRC_COMP1                  /*!< For LPTIM1 and LPTIM2 */
#define LL_LPTIM_INPUT1_SRC_COMP2                  /*!< For LPTIM2 */
#define LL_LPTIM_INPUT1_SRC_COMP1_COMP2            /*!< For LPTIM2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_INPUT2_SRC Input2 Source
  * @{
  */
#define LL_LPTIM_INPUT2_SRC_GPIO         0x00000000U                   /*!< For LPTIM1 */
#define LL_LPTIM_INPUT2_SRC_COMP2                  /*!< For LPTIM1 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM1_IC1_RMP LPTIM1 Input Ch1 Remap
  * @{
  */
#define LL_LPTIM_LPTIM1_IC1_RMP_GPIO          0x00000000UL                 /*!< IC1 connected to GPIO */
#if defined(STM32MP21xxxx)
#define LL_LPTIM_LPTIM1_IC1_RMP_I3C1_IBIACK   LPTIM_CFGR2_IC1SEL_0         /*!< IC1 connected to I3C1_IBIACK */
#define LL_LPTIM_LPTIM1_IC1_RMP_I3C2_IBIACK   LPTIM_CFGR2_IC1SEL_1         /*!< IC1 connected to I3C2_IBIACK */
#define LL_LPTIM_LPTIM1_IC1_RMP_I3C3_IBIACK   (LPTIM_CFGR2_IC1SEL_0 | LPTIM_CFGR2_IC1SEL_1) /*!< IC1 connected to I3C3_IBIACK */
#endif /* STM32MP21xxxx */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM1_IC2_RMP LPTIM1 Input Ch2 Remap
  * @{
  */
#define LL_LPTIM_LPTIM1_IC2_RMP_GPIO          0x00000000UL                 /*!< IC2 connected to GPIO */
#define LL_LPTIM_LPTIM1_IC2_RMP_HSI_1024      LPTIM_CFGR2_IC2SEL_0         /*!< IC2 connected to HSI/1024 */
#define LL_LPTIM_LPTIM1_IC2_RMP_MSI           LPTIM_CFGR2_IC2SEL_1         /*!< IC2 connected to MSI */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM2_IC1_RMP LPTIM2 Input Ch1 Remap
  * @{
  */
#define LL_LPTIM_LPTIM2_IC1_RMP_GPIO          0x00000000UL                 /*!< IC1 connected to GPIO */
#if defined(STM32MP21xxxx)
#define LL_LPTIM_LPTIM2_IC1_RMP_I3C1_IBIACK   LPTIM_CFGR2_IC1SEL_0         /*!< IC1 connected to I3C1_IBIACK */
#define LL_LPTIM_LPTIM2_IC1_RMP_I3C2_IBIACK   LPTIM_CFGR2_IC1SEL_1         /*!< IC1 connected to I3C2_IBIACK */
#define LL_LPTIM_LPTIM2_IC1_RMP_I3C3_IBIACK   (LPTIM_CFGR2_IC1SEL_0 | LPTIM_CFGR2_IC1SEL_1) /*!< IC1 connected to I3C3_IBIACK */
#endif /* STM32MP21xxxx */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM2_IC2_RMP LPTIM2 Input Ch2 Remap
  * @{
  */
#define LL_LPTIM_LPTIM2_IC2_RMP_GPIO          0x00000000UL                 /*!< IC2 connected to GPIO */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM3_IC1_RMP LPTIM3 Input Ch1 Remap
  * @{
  */
#define LL_LPTIM_LPTIM3_IC1_RMP_GPIO          0x00000000UL                 /*!< IC1 connected to GPIO */
#define LL_LPTIM_LPTIM3_IC1_RMP_MSI           LPTIM_CFGR2_IC1SEL_0         /*!< IC1 connected to MSI */
#if defined(STM32MP21xxxx)
#define LL_LPTIM_LPTIM3_IC1_RMP_I3C2_IBIACK   LPTIM_CFGR2_IC1SEL_1         /*!< IC1 connected to I3C2_IBIACK */
#define LL_LPTIM_LPTIM3_IC1_RMP_I3C3_IBIACK   (LPTIM_CFGR2_IC1SEL_0 | LPTIM_CFGR2_IC1SEL_1) /*!< IC1 connected to I3C3_IBIACK */
#endif /* STM32MP21xxxx */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM3_IC2_RMP LPTIM3 Input Ch2 Remap
  * @{
  */
#define LL_LPTIM_LPTIM3_IC2_RMP_GPIO          0x00000000UL                 /*!< IC2 connected to GPIO */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM4_IC1_RMP LPTIM4 Input Ch1 Remap
  * @{
  */
#define LL_LPTIM_LPTIM4_IC1_RMP_GPIO          0x00000000UL                 /*!< IC1 connected to GPIO */
#define LL_LPTIM_LPTIM4_IC1_RMP_LSI           LPTIM_CFGR2_IC1SEL_0         /*!< IC1 connected to LSI */
#define LL_LPTIM_LPTIM4_IC1_RMP_LSE           LPTIM_CFGR2_IC1SEL_1         /*!< IC1 connected to LSE */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM4_IC2_RMP LPTIM4 Input Ch2 Remap
  * @{
  */
#define LL_LPTIM_LPTIM4_IC2_RMP_GPIO          0x00000000UL                 /*!< IC2 connected to GPIO */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup LPTIM_LL_Exported_Macros LPTIM Exported Macros
  * @{
  */

